Tekla Open API Reference for Tekla Structures 2025
SettingsProxy.GetValue Method
 Gets the value of the setting with the given name.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Object GetValue(
	string name
)
Public Function GetValue (
	name As String
) As Object
Parameters
name
Type: System.String
The name of the setting.
Return Value
Type: Object
The value of the given setting.
See Also
Reference
SettingsProxy Class
Tekla.Structures.Datatype Namespace